{"authors": [{"name": "/u/throwawayawayawayaah", "href": "https://www.reddit.com/user/throwawayawayawayaah"}], "author_detail": {"name": "/u/throwawayawayawayaah", "href": "https://www.reddit.com/user/throwawayawayawayaah"}, "href": "https://www.reddit.com/user/throwawayawayawayaah", "author": "/u/throwawayawayawayaah", "tags": [{"term": "relationships", "scheme": null, "label": "r/relationships"}], "content": [{"type": "text/html", "language": null, "base": "https://www.reddit.com/r/relationships/top/.rss?limit=50", "value": "<!-- SC_OFF --><div class=\"md\"><p><em>Edit: Added the second half of the neighbor&#39;s original text message I accidentally left out of the original post.</em></p> <p>For context, I (37M) live in a small apartment building in NYC, and while she does not live here, my girlfriend (33F) is here about half the nights per week. She&#39;s polyamorous and lives with her husband in a one-bedroom apartment, so it is not practical for us to have sex at her place. To be clear from the outset, the poly aspect of the relationship is not a factor in this situation beyond this specific logistical constraint.</p> <p>While I wouldn&#39;t say I&#39;m friends with my downstairs neighbors, I&#39;m friendly with them.<br/> Yesterday morning I woke up to this ambiguous text message from the wife downstairs, sent around midnight:</p> <blockquote> <p>&quot;Hi there&#39;s kids here&quot;</p> </blockquote> <p>When I asked for clarification she said:</p> <blockquote> <p>&quot;I&#39;m talking about the screaming orgasms lol. The past two months while you were out of the country we&#39;re actually the only two months we had quiet since last spring. Your girlfriend is really extremely loud when she has her orgasms and my kids are starting to complain. My son says it happens while he does his homework. We have family visiting from Chicago right now and they&#39;re complaining. I wrote to you last night. Because it was actually happening while I was writing to you. Sometimes I&#39;m awaken at 2:30 in the morning with these screams sometimes I wake up and it&#39;s 4 AM because of the screaming...</p> <p>I&#39;m sorry it&#39;s a little bit sensitive to speak about this but it&#39;s been months and months and months of this ongoing. Don&#39;t get us wrong we&#39;re happy to have you back . It&#39;s just that we have children and we have families visiting us with children like our niece from Macedonia was here last summer and she was only 11 and we had to explain to her what&#39;s going on and we really didn&#39;t know how to handle it nor did we want to. When we talk to them over the phone they are still asking us about the screaming, if it still happening... We&#39;re all adults we all have sex, but we try to keep it intimate.<em>&quot;</em></p> </blockquote> <p>I showed this to my girlfriend sort when I received it and she asked, &quot;Am I really that loud?&quot; I said, &quot;Yes, you are very loud.&quot; She asked me a few times and I gave her the same response each time.</p> <p>Unfortunately, this all happened about two minutes before I had to take a work call and she had to leave for her job, so we weren&#39;t able to properly talk about things in the moment. Upon reflection, this seems like a mistake on my part, since I know she&#39;s very sensitive to things where it feels like someone is dictating to her what she can and can&#39;t do, which is very much tied up in responses to having been raised by a narcissistic parent. I feel like throwing this at her without any time to talk about it was ill-advised on my part.</p> <p>Anyway, how loud she is when we have sex does sometimes make me feel self-conscious and I&#39;ve worried in the past that other people in the building could hear us. I&#39;m very conflict averse, and also sensitive to noise issues myself, so I really go out of my way to be a courteous neighbor (I even do things like walking on the balls of my feet when walking on the parts of my floor that aren&#39;t carpeted in order to not make excessive noise for my neighbors). In the past, I&#39;ve communicated this to her and her response has been something to the effect of, &quot;Who cares? People have sex? If other people hear and they have a problem with it, that&#39;s their problem.&quot; It&#39;s true that I&#39;m a very self-conscious person, so I tried to push myself a little bit in the direction of, &quot;Fine, if someone hears us, it&#39;s not a big deal.&quot;</p> <p>That said, I responded to the neighbor, expressing my embarrassment and told her that I&#39;d talk to the girlfriend and see what I could do.</p> <p>Later that day, I received a text from the girlfriend telling me that she wanted to talk about it, and asked if I had already replied. I said:</p> <blockquote> <p>&quot;I apologized and said that we&#39;d try to keep it down. Although she was framing it as a sex issue, at the core of it, it seemed more like a noise issue. Among the things she was complaining about getting woken up in the middle of night, and asking for that not to happen seems like a legitimate request.&quot;</p> </blockquote> <p>She responded, saying:</p> <blockquote> <p>&quot;Yes that is my point. It was not framed as a &#39;I&#39;m sorry but you guys can’t make noise at night, and I’m happy you have sex but at night keep it quiet.&#39; She shamed me for being too loud, and she mentioned times during the day that we are being loud. I can make a compromise to not make noise at night, but during the day I’m not going to keep it down. I&#39;m sorry if she wants to have no noise. If she wants that, she should move to the countryside. This is New York! Also, I didn’t like that you told me, yes I’m too loud. It made me feel very sad and ashamed.&quot;</p> </blockquote> <p>We agreed to talk more about it later that evening. When we did, she told me that she was angry with me because she had had hangups about sex for many years that she&#39;d spent the last 15 years getting to the point where she felt like she could truly enjoy it and be herself, and the message the neighbor sent felt less like a straightforward noise request and more like it was sex shaming her, that it&#39;s not her (the girlfriend&#39;s) problem if my neighbor has to acknowledge the existence of sex to her niece, and that my simply telling her, &quot;Yes, you are very loud,&quot; made her feel like I was siding with the neighbor and shaming her as well. I agreed with her that the message involved a lot of unnecessary detail and that something like, &quot;Hey, I feel a little uncomfortable telling you this, but sometimes you guys are really loud upstairs and the floor/ceiling in this building doesn&#39;t provide much sound insulation, so we&#39;d really appreciate it if you could keep it down,&quot; would have been a much more straightforward and less weirdly explicit way to express their concerns, but at the heart of it, that was the core message I derived from the neighbor&#39;s text. The girlfriend&#39;s position was, &quot;Fuck her. Aside from not making noise at night, she has no right to dictate how or when we have sex, and I&#39;m not going to put up with puritanical bullshit. In Spain, this would never happen! People would be applauding me!&quot; I gently reminded her that we&#39;re not in Spain, to which I got another comment regarding puritanical Americans, to which I reminded her that the neighbors are from Macedonia. This did not go over well.</p> <p>I expressed to her that I felt like I was in a bind where her being unwilling to consider any compromise (which essentially would mean her being somewhat quieter when we have sex during the date) made me feel like she was unilaterally dictating to me the nature of the relationship I have with my neighbor. A thought that crossed my mind was, &quot;Well, if you&#39;re unwilling to compromise, perhaps I just need to refuse to have sex with you during the day,&quot; but I didn&#39;t say it, since that just felt like an unproductive escalation / ultimatum.</p> <p>One of the questions I kept coming back to with her was, &quot;Are you upset about what is being asked of you or are you upset at the way it was asked?&quot; She kept reiterating something to the effect of, &quot;She&#39;s not asking anything, she&#39;s telling me that I should be ashamed of myself!&quot; and that she&#39;s a loud person by nature (this is very true) and that she felt rejected by me by my going along with the neighbor and like I wasn&#39;t there to back her up against what felt to her like unreasonable criticism.</p> <p>At some point during this discussion, we got to what seemed to be the deeper issue at play, which was that she worried that because of this particular difference we have--that I&#39;m a very reserved, quiet person, she&#39;s very outgoing and loud (part personal nature, part Southern European origin)--that she essentially felt that I was telling her that I was uncomfortable with who she is fundamentally and that I wouldn&#39;t be able to love her fully for who she is. I told her that what I feel uncomfortable about is not the fact that she&#39;s a loud person (in most cases I love that she&#39;s the life of the party and can make friends with anyone), but with my discomfort with conflict with people around me. I told her that I wasn&#39;t sure how to effectively communicate to her the fact that I could feel these two things simultaneously. Eventually she told me that what she had needed from me was reassurance, things along the lines of, &quot;It turns me on that you&#39;re loud and that I know how enthusiastic you are about me, but maybe you can just keep in mind just how loud you&#39;re being.&quot; Effectively giving words of affirmation is probably one of my biggest weaknesses, so it didn&#39;t occur to me to say this sort of things in immediate response to the text.</p> <p>We circled around these questions seemingly ad nauseam, where things would feel better as I reassured her that I didn&#39;t feel there was anything fundamentally wrong with her, but then where she&#39;d feel rejected when she&#39;d bring up the neighbor again and I&#39;d be unwilling to fully endorse her view that the neighbor&#39;s text was egregious to the point of being wilful shaming and that, beyond not waking them up in the night, that we should ignore it. She said, &quot;Imagine if this was about me playing piano. I would say, &#39;Yes, I&#39;ll respect your right to have quiet during the night, but during the day, I&#39;m within my rights to make noise in my apartment.&#39;&quot; To an extent I agree with her, but I also feel like she underestimates just how loud she is, how poor the sound insulation in my building is, and just how much sound permeates other apartments. I also feel like it&#39;s a legitimate request for a neighbor to not want to have figurative front-row seats to someone else&#39;s sex life, but I&#39;m also not the one in this situation who is being ask (told?) to change his behavior, nor would I feel any conflict in fulfilling that request if I were. My trying to reinterpret the neighbor&#39;s text as a legitimate expression of pent up frustration, however, seems to keep looping us back into the same place we started.</p> <p>To me it feels like the issue here has less to do with the neighbors and more about my girlfriend feeling insecure about my feelings about her, but given the context above, I&#39;m not sure how to approach this.</p> <p><strong>Tl;dr:</strong></p> <ul> <li>Neighbor sent an awkwardly explicit text telling me that my girlfriend is too loud during sex and that it&#39;s been bothering them for months.</li> <li>This feels like no biggie to me, girlfriend feels like she&#39;s being sex shamed.</li> <li>Girlfriend feels like I&#39;m rejecting her / sex shaming her by legitimizing the neighbor&#39;s message and asking her to be quieter when we have sex during the day</li> </ul> <p>I&#39;m unsure how to validate the girlfriend&#39;s feelings while still feeling like I&#39;m being a respectful neighbor and I don&#39;t know how to proceed. <a href=\"/r/relationships\">r/relationships</a>, what do y&#39;all think? Any advice would be deeply appreciated.</p> <p>&#x200B;</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/throwawayawayawayaah\"> /u/throwawayawayawayaah </a> <br/> <span><a href=\"https://www.reddit.com/r/relationships/comments/18j80z0/my_37m_neighbor_complained_via_awkward_text_that/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/relationships/comments/18j80z0/my_37m_neighbor_complained_via_awkward_text_that/\">[comments]</a></span>"}], "summary": "<!-- SC_OFF --><div class=\"md\"><p><em>Edit: Added the second half of the neighbor&#39;s original text message I accidentally left out of the original post.</em></p> <p>For context, I (37M) live in a small apartment building in NYC, and while she does not live here, my girlfriend (33F) is here about half the nights per week. She&#39;s polyamorous and lives with her husband in a one-bedroom apartment, so it is not practical for us to have sex at her place. To be clear from the outset, the poly aspect of the relationship is not a factor in this situation beyond this specific logistical constraint.</p> <p>While I wouldn&#39;t say I&#39;m friends with my downstairs neighbors, I&#39;m friendly with them.<br/> Yesterday morning I woke up to this ambiguous text message from the wife downstairs, sent around midnight:</p> <blockquote> <p>&quot;Hi there&#39;s kids here&quot;</p> </blockquote> <p>When I asked for clarification she said:</p> <blockquote> <p>&quot;I&#39;m talking about the screaming orgasms lol. The past two months while you were out of the country we&#39;re actually the only two months we had quiet since last spring. Your girlfriend is really extremely loud when she has her orgasms and my kids are starting to complain. My son says it happens while he does his homework. We have family visiting from Chicago right now and they&#39;re complaining. I wrote to you last night. Because it was actually happening while I was writing to you. Sometimes I&#39;m awaken at 2:30 in the morning with these screams sometimes I wake up and it&#39;s 4 AM because of the screaming...</p> <p>I&#39;m sorry it&#39;s a little bit sensitive to speak about this but it&#39;s been months and months and months of this ongoing. Don&#39;t get us wrong we&#39;re happy to have you back . It&#39;s just that we have children and we have families visiting us with children like our niece from Macedonia was here last summer and she was only 11 and we had to explain to her what&#39;s going on and we really didn&#39;t know how to handle it nor did we want to. When we talk to them over the phone they are still asking us about the screaming, if it still happening... We&#39;re all adults we all have sex, but we try to keep it intimate.<em>&quot;</em></p> </blockquote> <p>I showed this to my girlfriend sort when I received it and she asked, &quot;Am I really that loud?&quot; I said, &quot;Yes, you are very loud.&quot; She asked me a few times and I gave her the same response each time.</p> <p>Unfortunately, this all happened about two minutes before I had to take a work call and she had to leave for her job, so we weren&#39;t able to properly talk about things in the moment. Upon reflection, this seems like a mistake on my part, since I know she&#39;s very sensitive to things where it feels like someone is dictating to her what she can and can&#39;t do, which is very much tied up in responses to having been raised by a narcissistic parent. I feel like throwing this at her without any time to talk about it was ill-advised on my part.</p> <p>Anyway, how loud she is when we have sex does sometimes make me feel self-conscious and I&#39;ve worried in the past that other people in the building could hear us. I&#39;m very conflict averse, and also sensitive to noise issues myself, so I really go out of my way to be a courteous neighbor (I even do things like walking on the balls of my feet when walking on the parts of my floor that aren&#39;t carpeted in order to not make excessive noise for my neighbors). In the past, I&#39;ve communicated this to her and her response has been something to the effect of, &quot;Who cares? People have sex? If other people hear and they have a problem with it, that&#39;s their problem.&quot; It&#39;s true that I&#39;m a very self-conscious person, so I tried to push myself a little bit in the direction of, &quot;Fine, if someone hears us, it&#39;s not a big deal.&quot;</p> <p>That said, I responded to the neighbor, expressing my embarrassment and told her that I&#39;d talk to the girlfriend and see what I could do.</p> <p>Later that day, I received a text from the girlfriend telling me that she wanted to talk about it, and asked if I had already replied. I said:</p> <blockquote> <p>&quot;I apologized and said that we&#39;d try to keep it down. Although she was framing it as a sex issue, at the core of it, it seemed more like a noise issue. Among the things she was complaining about getting woken up in the middle of night, and asking for that not to happen seems like a legitimate request.&quot;</p> </blockquote> <p>She responded, saying:</p> <blockquote> <p>&quot;Yes that is my point. It was not framed as a &#39;I&#39;m sorry but you guys can’t make noise at night, and I’m happy you have sex but at night keep it quiet.&#39; She shamed me for being too loud, and she mentioned times during the day that we are being loud. I can make a compromise to not make noise at night, but during the day I’m not going to keep it down. I&#39;m sorry if she wants to have no noise. If she wants that, she should move to the countryside. This is New York! Also, I didn’t like that you told me, yes I’m too loud. It made me feel very sad and ashamed.&quot;</p> </blockquote> <p>We agreed to talk more about it later that evening. When we did, she told me that she was angry with me because she had had hangups about sex for many years that she&#39;d spent the last 15 years getting to the point where she felt like she could truly enjoy it and be herself, and the message the neighbor sent felt less like a straightforward noise request and more like it was sex shaming her, that it&#39;s not her (the girlfriend&#39;s) problem if my neighbor has to acknowledge the existence of sex to her niece, and that my simply telling her, &quot;Yes, you are very loud,&quot; made her feel like I was siding with the neighbor and shaming her as well. I agreed with her that the message involved a lot of unnecessary detail and that something like, &quot;Hey, I feel a little uncomfortable telling you this, but sometimes you guys are really loud upstairs and the floor/ceiling in this building doesn&#39;t provide much sound insulation, so we&#39;d really appreciate it if you could keep it down,&quot; would have been a much more straightforward and less weirdly explicit way to express their concerns, but at the heart of it, that was the core message I derived from the neighbor&#39;s text. The girlfriend&#39;s position was, &quot;Fuck her. Aside from not making noise at night, she has no right to dictate how or when we have sex, and I&#39;m not going to put up with puritanical bullshit. In Spain, this would never happen! People would be applauding me!&quot; I gently reminded her that we&#39;re not in Spain, to which I got another comment regarding puritanical Americans, to which I reminded her that the neighbors are from Macedonia. This did not go over well.</p> <p>I expressed to her that I felt like I was in a bind where her being unwilling to consider any compromise (which essentially would mean her being somewhat quieter when we have sex during the date) made me feel like she was unilaterally dictating to me the nature of the relationship I have with my neighbor. A thought that crossed my mind was, &quot;Well, if you&#39;re unwilling to compromise, perhaps I just need to refuse to have sex with you during the day,&quot; but I didn&#39;t say it, since that just felt like an unproductive escalation / ultimatum.</p> <p>One of the questions I kept coming back to with her was, &quot;Are you upset about what is being asked of you or are you upset at the way it was asked?&quot; She kept reiterating something to the effect of, &quot;She&#39;s not asking anything, she&#39;s telling me that I should be ashamed of myself!&quot; and that she&#39;s a loud person by nature (this is very true) and that she felt rejected by me by my going along with the neighbor and like I wasn&#39;t there to back her up against what felt to her like unreasonable criticism.</p> <p>At some point during this discussion, we got to what seemed to be the deeper issue at play, which was that she worried that because of this particular difference we have--that I&#39;m a very reserved, quiet person, she&#39;s very outgoing and loud (part personal nature, part Southern European origin)--that she essentially felt that I was telling her that I was uncomfortable with who she is fundamentally and that I wouldn&#39;t be able to love her fully for who she is. I told her that what I feel uncomfortable about is not the fact that she&#39;s a loud person (in most cases I love that she&#39;s the life of the party and can make friends with anyone), but with my discomfort with conflict with people around me. I told her that I wasn&#39;t sure how to effectively communicate to her the fact that I could feel these two things simultaneously. Eventually she told me that what she had needed from me was reassurance, things along the lines of, &quot;It turns me on that you&#39;re loud and that I know how enthusiastic you are about me, but maybe you can just keep in mind just how loud you&#39;re being.&quot; Effectively giving words of affirmation is probably one of my biggest weaknesses, so it didn&#39;t occur to me to say this sort of things in immediate response to the text.</p> <p>We circled around these questions seemingly ad nauseam, where things would feel better as I reassured her that I didn&#39;t feel there was anything fundamentally wrong with her, but then where she&#39;d feel rejected when she&#39;d bring up the neighbor again and I&#39;d be unwilling to fully endorse her view that the neighbor&#39;s text was egregious to the point of being wilful shaming and that, beyond not waking them up in the night, that we should ignore it. She said, &quot;Imagine if this was about me playing piano. I would say, &#39;Yes, I&#39;ll respect your right to have quiet during the night, but during the day, I&#39;m within my rights to make noise in my apartment.&#39;&quot; To an extent I agree with her, but I also feel like she underestimates just how loud she is, how poor the sound insulation in my building is, and just how much sound permeates other apartments. I also feel like it&#39;s a legitimate request for a neighbor to not want to have figurative front-row seats to someone else&#39;s sex life, but I&#39;m also not the one in this situation who is being ask (told?) to change his behavior, nor would I feel any conflict in fulfilling that request if I were. My trying to reinterpret the neighbor&#39;s text as a legitimate expression of pent up frustration, however, seems to keep looping us back into the same place we started.</p> <p>To me it feels like the issue here has less to do with the neighbors and more about my girlfriend feeling insecure about my feelings about her, but given the context above, I&#39;m not sure how to approach this.</p> <p><strong>Tl;dr:</strong></p> <ul> <li>Neighbor sent an awkwardly explicit text telling me that my girlfriend is too loud during sex and that it&#39;s been bothering them for months.</li> <li>This feels like no biggie to me, girlfriend feels like she&#39;s being sex shamed.</li> <li>Girlfriend feels like I&#39;m rejecting her / sex shaming her by legitimizing the neighbor&#39;s message and asking her to be quieter when we have sex during the day</li> </ul> <p>I&#39;m unsure how to validate the girlfriend&#39;s feelings while still feeling like I&#39;m being a respectful neighbor and I don&#39;t know how to proceed. <a href=\"/r/relationships\">r/relationships</a>, what do y&#39;all think? Any advice would be deeply appreciated.</p> <p>&#x200B;</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/throwawayawayawayaah\"> /u/throwawayawayawayaah </a> <br/> <span><a href=\"https://www.reddit.com/r/relationships/comments/18j80z0/my_37m_neighbor_complained_via_awkward_text_that/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/relationships/comments/18j80z0/my_37m_neighbor_complained_via_awkward_text_that/\">[comments]</a></span>", "id": "https://www.reddit.com/r/relationships/top/t3_18j80z0", "guidislink": true, "link": "https://www.reddit.com/r/relationships/comments/18j80z0/my_37m_neighbor_complained_via_awkward_text_that/", "links": [{"href": "https://www.reddit.com/r/relationships/comments/18j80z0/my_37m_neighbor_complained_via_awkward_text_that/", "rel": "alternate", "type": "text/html"}], "updated": "2023-12-15T19:23:50+00:00", "updated_parsed": [2023, 12, 15, 19, 23, 50, 4, 349, 0], "published": "2023-12-15T19:23:50+00:00", "published_parsed": [2023, 12, 15, 19, 23, 50, 4, 349, 0], "title": "My [37M] neighbor complained via awkward text that my girlfriend [33F] is too loud during sex. Girlfriend feels sex shamed by the neighbor and rejected by me when I suggest that the neighbor might have a point. How do I deal with this? [Long post]", "title_detail": {"type": "text/plain", "language": null, "base": "https://www.reddit.com/r/relationships/top/.rss?limit=50", "value": "My [37M] neighbor complained via awkward text that my girlfriend [33F] is too loud during sex. Girlfriend feels sex shamed by the neighbor and rejected by me when I suggest that the neighbor might have a point. How do I deal with this? [Long post]"}}